#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#10. Дані про температуру повітря за декаду листопада зберігаються в масиві.
#Визначити, скільки разів температура опускалася нижче -10 градусів.
import numpy as np #імпортуємо numpy

q = np.zeros(10, dtype = int) #створюємо масив з нулями
for i in range(10):
    while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
        try:
            q[i] = int(input(f'{i+1} температура за декаду листопада: ')) #елементи масиву
            break
        except ValueError:
            print('Введіть лише ціле число')
print(q)

k = 0 #кількість разів, коли температура опускалася нижче -10 градусів
for i in range(len(q)): #проходимося по нашому масиві
    if q[i] < -10: #якщо елемент масиву менший за -10, то добавляємо +1
        k += 1
print(f'Температура опускалася нижче -10 градусів {k} раз(-ів, -и)')
