#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#12. Дані про температуру повітря за декаду грудня зберігаються в масиві.
#Визначити, скільки раз температура була вище середньої за цю декаду.
import numpy as np #імпортуємо numpy

q = np.zeros(10, dtype = int) #створюємо масив з нулями
for i in range(10):
    while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
        try:
            q[i] = int(input(f'{i+1} температура повітря за декаду грудня: ')) #елементи масиву
            break
        except ValueError:
            print('Введіть лише ціле число')
print(q)

k = 0 #кількість разів коли температура була вище середньої за цю декаду
print(np.mean(q)) #середнє арифметичне масиву
for i in range(len(q)): #проходимося по нашому масиві
    if q[i] > np.mean(q): #якщо елемент більший за середнє арифметичне масиву, то добавляємо +1
        k += 1
print(f'Температура була вище середньої за цю декаду: {k} раз(-ів, -и)')
