#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#17. Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
#Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100 до 200
import numpy as np #імпортуємо numpy

p = np.random.uniform(100, 200, 20) #масив з рандомних дійсних чисел
print(p)

t = [] #пустий список
for k in range(len(p)): #проходимося по нашому масиві
    if k % 2 == 1: #якщо номер елемента непарний, добавляємо цей елемент в список
        t.append(p[k])
print(t)
print(sum(t)) #знаходимо суму цих елементів

