#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#18. Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
#масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
import numpy as np #імпортуємо numpy

q = np.zeros(10, dtype = int) #створюємо масив з нулями
for i in range(10):
    while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
        try:
            q[i] = int(input(f'q[{i}] = '))
            break
        except ValueError:
            print('Введіть лише ціле число')
print(q)

k = [] #пустий список
m = 1
for i in q: #проходимося по нашому масиві
    if i < 0: #якщо елемент менший за нуль, добавляємо його в список
        k.append(i)
        m *= i #знаходимо добуток цих елементів
print(k)
print(m)

