#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#19. Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
#остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 200 до 300.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

a = np.array([random.randint(200, 300) for i in range(20)]) #масив з рандомних цілих чисел
print(a)

w = [] #пустий список
for i in a: #проходимося по нашому масиві
    if i % 2 == 3: #якщо елемент при діленні на 2 має остачу 3, то добавляємо його в список
        w.append(i)
print(w)
print(sum(w))

