#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#20. Знайти суму всіх елементів масиву дійсних чисел, більших за задане
#число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 50 до 100.
import numpy as np #імпортуємо numpy

p = np.random.uniform(50, 100, 20) #масив з рандомних дійсних чисел
print(p)

while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
    try:
        z = float(input('Введіть число з яким будуть порівнюватись елементи масиву: '))
        break
    except ValueError:
        print('Введіть лише число')

t = [] #пустий список
for i in p: #проходимося по нашому масиві
    if i > z: #якщо елемент більший за z, то довабляємо його в список
        t.append(i)
print(t)
print(sum(t)) #знаходимо суму цих елементів
