#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#21. Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
#числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
#від 50 до 100.
import numpy as np #імпортуємо numpy

p = np.random.uniform(50, 100, 10) #масив з рандомних дійсних чисел
print(p)

while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
    try:
        z = float(input('Введіть число з яким будуть порівнюватись елементи масиву: '))
        break
    except ValueError:
        print('Введіть лише число')

k = []
m = 1
for i in p: #проходимося по нашому масиві
    if i < z: #якщо елемент менший за z, то довабляємо його в список
        k.append(i)
        m *= i #знаходимо добуток цих елементів
print(k)
print(m)
