#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#23. Знайти суму всіх елементів масиву цілих чисел, які менше середнього
#арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 150 до 300.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(150, 300) for i in range(20)]) #масив з рандомних цілих чисел
print(d)

f = d.mean()
print('Середнє арифметичне елементів масиву: ', f)

t = [] #пустий список
for i in d: #проходимося по нашому масиві
    if i < f: #якщо елемент менший за середнє арифметичне, добавляємо його в список
        t.append(i)
print(t)
print(sum(t)) #і знаходимо суму цих елементів
