#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#24. Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
#одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
#числами від 500 до 1000
import numpy as np #імпортуємо numpy
import random #імпортуємо random

s = np.array([random.randint(500, 1000) for i in range(30)]) #масив з рандомних цілих чисел
print(s)

k = [] #пустий список
for i in s: #проходимося по нашому масиві
    if i % 5 == 0 and i % 8 == 0: #якщо елемент кратний 5 і 8, добавляємо його в список
        k.append(i)
print(k)
print(sum(k)) #знаходимо суму цих елементів

