#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#25. Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
#Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до 100.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

s = np.array([random.randint(10, 100) for i in range(10)]) #масив з рандомних цілих чисел
print(s)

k = [] #пустий список
m = 1
for i in s: #проходимося по нашому масиві
    if i % 5 == 0: #якщо елемент кратний 5, добавляємо його в список
        k.append(i)
        m *= i #знаходимо добуток цих елементів
print(k)

if m > 1:
    print(m)
else:
    print('Елементів, що кратні 5 немає, тому добутку теж')
