#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#27. Лінійний масив містить відомості про кількість опадів, що випали за
#кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
#опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
#місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
import numpy as np #імпортуємо numpy

a = np.zeros(12, dtype=int) #створюємо масив з нулями
for i in range(12):
    while True: #створюємо умову для зациклення, в разі невірного вводу користувачем
        try:
            a[i] = int(input(f'Введіть кількість опадів за [{i+1}] місяць: '))  # елементи масиву
            break
        except ValueError:
            print('Введіть лише число')

print(a)

print('Загальну кількість опадів протягом цього року: ', sum(a))
print('Середньомісячна кількість опадів: ', np.mean(a))

k = [] #пустий список
for i in range(len(a)): #проходимося по нашому масиві
    if a[i] < 30: #якшо елемент менший за 30, добавляємо його в список
        k.append(a[i])

if len(k) > 0:
    print('Кількість посушливих місяців (коли кількість опадів було менше 30 мм): ', len(k))
else:
    print('Посушливих місяців в цьому році немає')

if a[0] == min(a): #залежно від того який елемент буде мінімальним, будемо виводити
    print('Найпосушливіший місяць: Січень')
elif a[1] == min(a):
    print('Найпосушливіший місяць: Лютий')
elif a[2] == min(a):
    print('Найпосушливіший місяць: Березень')
elif a[3] == min(a):
    print('Найпосушливіший місяць: Квітень')
elif a[4] == min(a):
    print('Найпосушливіший місяць: Травень')
elif a[5] == min(a):
    print('Найпосушливіший місяць: Червень')
elif a[6] == min(a):
    print('Найпосушливіший місяць: Липень')
elif a[7] == min(a):
    print('Найпосушливіший місяць: Серпень')
elif a[8] == min(a):
    print('Найпосушливіший місяць: Вересень')
elif a[9] == min(a):
    print('Найпосушливіший місяць: Жовтень')
elif a[10] == min(a):
    print('Найпосушливіший місяць: Листопад')
elif a[11] == min(a):
    print('Найпосушливіший місяць: Грудень')
