#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#28. Знайти кількість парних елементів одновимірного масиву.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(100, 300) for i in range(20)]) #масив з рандомних цілих чисел
print(d)

k = [] #пустий список
for i in d: #проходимося по нашому масиві
    if i % 2 == 0: #якщо елемент кратний 2, добавляємо його в список
        k.append(i)
print(k)
print(len(k)) #знаходимо кількість парних елементів масиву

