#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#29. Знайти кількість парних елементів одновимірного масиву до першого
#зустрінутого числа рівного наперед заданому числу а.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(1, 300) for i in range(40)]) #масив з рандомних цілих чисел
print(d)

a = int(input('Введіть число a: '))
k = [] #пустий список
for i in range(len(d)): #проходимося по нашому масиві
    if d[i] % 2 == 0 or d[i] == a: #і добавляємо в список парні елементи масиву до першого зустрінутого
        #наперед заданого числа a
        if d[i] == a:
            break
        k.append(d[i])
print(k)
print(len(k)) #знаходимо їхню кількість
