#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#30. Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які розташовані за першим по порядку мінімальним елементом.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(1, 50) for i in range(15)]) #масив з рандомних цілих чисел
print(d)

a = min(d) #мінімальний елемент масиву d
s = [] #пустий список
for i in range(len(d)): #проходимося по нашому масиві
    s.append(i) #добавляємо всі елементи масиву в списку до першого зустрінутого мінімального елементу
    if d[i] == a:
        break

print(np.delete(d, s)) #видаляємо ці елементи разом із min(d) з масиву
print(np.mean(np.delete(d, s))) #шукаємо середнє арифметичне тих елементів, які розташовані за першим по
#порядку мінімальним елементом
