#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#31. Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які потрапляють в інтервал від -2 до 10.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(-10, 20) for i in range(20)]) #масив з рандомних цілих чисел
print(d)

k = [] #пустий список
for i in d: #проходимося по нашому масиві
    if (i < 10 and i > -2): #якщо елемент потрапляє до інтервалу від -2 до 10, то
        k.append(i) #добавляємо його до списку
print(k)
print(np.mean(k)) #знаходимо середнє арифметичне цих елементів