#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#32. Змінній t привласнити значення істина, якщо в одновимірному масиві є
#хоча б одне від’ємне і парне число.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(-4, 10) for i in range(10)]) #масив з рандомних цілих чисел
print(d)

t = False #змінній t було присвоєно значення хиби
k = 0 #кількість від'ємних і парних елементів
for i in range(len(d)): #проходимося по нашому масиві
    if d[i] < 0 and d[i] % 2 == 0: #якщо є від'ємні і парні(одночасно) елементи, то
        k += 1 #добавляємо +1

if k > 0: #якщо є хоча б одне від'ємне і парне число, то
    t = True #змінній t присвоюємо значення істини
    print('Змінній t було присвоєно значення істина')
else: #в іншому випадку виведемо
    print("Змінній t не було присвоєно значення істина, тому що в масиві немає жодного від'ємного і парного числа")
