#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#33. Заданий масив А (1:20). Знайти добуток всіх його ненульових елементів.
import numpy as np #імпортуємо numpy

q = np.zeros(20, dtype = int) #створюємо масив з нулями
for i in range(20):
    while True:
        try:
            q[i] = int(input(f'q[{i}] = ')) #елементи масиву
            break
        except ValueError:
            print('Введіть лише ціле число') #помилка, у разі невірного вводу, виведемо
print(q)

k = [] #пустий список
m = 1
for i in q: #проходимося по нашому масиві
    if i != 0: #якщо елемент не дорівнює нулю, то
        k.append(i) #то добавляємо його в список
        m *= i #добуток ненульових елементів
print(k)

if m > 1:
    print(m)
else:
    print('Масив складається тільки з нульових елементів, тому добутку ненульових елементів немає')
