#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#34. Дано два лінійних масиву однакової розмірності. Скласти третій масив з
#добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

n = int(input('Введіть розмір одновимірного масиву: '))
a = np.array([random.randint(1, 20) for i in range(n)])
print(a)
b = np.array([random.randint(-10, 10) for j in range(n)])
print(b)

f = np.array(*[a * b]) #третій масив, який складається з добутку елементів двох попередніх,
#що стоять на місцях з однаковим індексом
print(f)
