#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#37. Розсортуйте заданий лінійний масив по зростанню.
import numpy as np #імпортуємо numpy

while True:  # створюємо умову для зациклення, в разі невірного вводу користувачем
    try:
        n = int(input(
            'Введіть кількість елементів масиву"максимальна кількість-30": '))  # запитуємо користувача, кількість елементів, яку він хоче задати
        if (n < 1 or n > 30):  # кількість елементів може бути від 1 до 30
            print('Кількість елементів масиву має бути не більше 30 і не менше 1')  # в разі невірного вводу, виведемо
            continue
        break
    except ValueError:
        print('Ви можете ввести лише цілі числа від 0 до 30')  # помилка, у разі невірного вводу, виведемо
q = np.zeros(n, dtype=int)  # створюємо масив з нулями
for i in range(n):
    while True:
        try:
            q[i] = int(input(f'q[{i}] = '))  # елементи масиву
            break
        except ValueError:
            print('Введіть лише ціле число')  # помилка, у разі невірного вводу, виведемо
print(q)

n = len(q)
for i in range(n):  # зовнішній цикл для проходження по масиву
    flag = False  # прапор для оптимізації сортування
    for j in range(0, n - i - 1):  # внутрішній цикл
        if q[j] > q[j + 1]:  # якщо наступний елемент масиву менший за попередній
            q[j], q[j + 1] = q[j + 1], q[j]  # то міняємо їх місцями
            flag = True  # змінюємо прапор на правду
    if flag == False:  # знінюємо прапор на хибу
        break
print('Відсортований масив:', q)
