#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#4. Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
#починаються з певної букви, яка вводиться з клавіатури.
import numpy as np #імпортуємо numpy

text = np.array([input('Введіть 1 прізвище: ').lower(),
                 input('Введіть 2 прізвище: ').lower(),
                 input('Введіть 3 прізвище: ').lower(),
                 input('Введіть 4 прізвище: ').lower(),
                 input('Введіть 5 прізвище: ').lower()])
print(text)
n = input('Введіть букву на яку вам виведуться прізвища: ')
print([word for word in text if word.startswith(n.lower())]) #за допомогою конструкції [word for word in text if word.startswith(n.lower())]
#нам будуть виводитись лише ті прізвища, які починаються на задану букву
