#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#41. Змінній t привласнити значення істина, якщо максимальний елемент
#одновимірного масиву єдиний і не перевищує наперед заданого числа а.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

u = np.array([random.randint(1, 25) for i in range(15)]) #масив з рандомних цілих чисел
print(u)

t = False #змінній t присвоєно значення хиби
a = int(input('Введіть ціле число: '))

p = 0 #кількість максимальних елементів
for i in range(len(u)): #проходимося по нашому масиві
    if max(u) == u[i]: #якщо маскимальний елемент дорівнює елементу масиву, то
        p += 1 #добавляємо +1

if p == 1 and max(u) < a: #якщо маскимальний елемент єдиний і не перевищує наперед заданого числа a, то
    #присвоюємо змінній t значення істини і виводимо
    t = True
    print('Змінній t було присвоєно значення істина')
else: #в іншому випадку виводимо
    print('Змінній t не було присвоєно значення істина')
