#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#43. Задано два натуральних числа a і b. Змінній w привласнити значення
#істина, якщо в одновимірному цілочисельному масиві є хоча б один елемент, кратний а
#і не кратний b.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

d = np.array([random.randint(1, 50) for i in range(10)]) #масив з рандомних цілих чисел
print(d)

a = int(input('Введіть ціле число: '))
b = int(input('Введіть ціле число: '))

k = [] #пустий список
w = False #змінній w присвоєно значення хиби
for i in range(len(d)): #проходимося по нашому масиві
    if d[i] % a == 0 and d[i] % b != 0: #якщо в масиві є такі елементи, які кратні a і не кратні b, то
        k.append(d[i]) #то добавляємо їх в список k
print(k)

if len(k) > 0: #підраховуємо їхню кількість, якщо є хоча б один такий елемент, то присвоюємо змінній w
    #значення істини
    w = True
    print('Змінній w було присвоєно значення істина')
else: #в іншому випадку виводимо
    print('Змінній w не було присвоєно значення істина, тому що елементів\
 кратних a і не кратних b немає')
