#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#46. Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
#повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
#назву першого товару з таблиці.
import numpy as np #імпортуємо numpy

n = input('Введіть назву першого товару: ').lower()
d = np.array([n, 'book', 'oreo', 'lenovo', 'milka', 'fly', 'key', 'money', 'windows', 'linux']) #масив з назв товарів
print(d)

k = 0 #кількість елементів, які рівні першому елементу масива
for i in range(len(d)): #проходимося по нашому масиві
    if d[0] == d[i]: #якщо такий елемент, який рівний першому елементу є, то
        k += 1 #добавляємо +1

if k > 1: #якщо k більше 1, то означає, що перший елемент повторюється і тоді ми видаляємо його з масиву
    print(np.delete(d, 0))
else: #в іншому випадку виводимо
    print('Назва першого товару не повторюється, тому вона не видаляється')
