#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#49. Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
#за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень
import numpy as np #імпортуємо numpy

q = np.array(['book', 'oreo', 'lenovo', 'milka', 'fly',
              'key', 'money', 'windows', 'linux', 'python']) #масив з найменуваннями послуг
print(q)
d = np.array([12, 34, 21, 45, 76, 54, 83, 98, 100, 63]) #їхня ціна
print(d)

G = int(input('Введіть ціну послуги: ')) #ціна послуги, яка буде слугувати для перевірки та видаленнея
#елементів, які йдуть після неї

k = [] #пустий список
for i in range(len(d)): #проходимося по нашому масиві
    k.append(i) #і добавляємо індикси в список k, допоки не наткнемося на послугу ціна, якої G
    if d[i] == G:
       break

r = [] #пустий список
for i in range(len(d)): #проходимося по нашому масиві
    r.append(i) #добавляємо в список r індекси всіх елементів

z = [] #пустий список
for i in r: #і робимо список індексів, які йдуть після G
    if not (i in k):
        z.append(i)

print(np.delete(q, z)) #за допомогою delete() видаляємо назви тих послуг, ціна яких йде після наперед заданої ціни послуги G
print(np.delete(d, z)) #за допомогою delete() видаляємо ціни послуг, які йдуть після наперед заданої ціни послуги G
