#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#51. Дан одновимірний масив а. Сформувати новий масив, який складається
#тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
#елементів немає, то видати повідомлення.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

a = np.array([random.randint(-5, 20) for i in range(30)]) #масив з рандомних цілих чисел
print(a)
e = np.array([])

k = [] #пустий список
for i in range(len(a)): #проходимося по нашому масиві
    if a[i] > i + 10: #якщо елемент перевищує свій номер на 10, то
        k.append(a[i]) #то добавляємо цей елемент в наш список k

if len(k) < 1: #якщо елементів, що перевищують свій номер на 10 немає, то виводимо
    print('Елементів, що перевищують свій номер на 10, немає')
else: #в іншому випадку, виводимо наш новий масив e, в який
    print(np.append(e, k)) #ми добавили елементи масиву a, що перевищували свій номер на 10
