#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
#мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
#і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
import numpy as np #імпортуємо numpy

q = np.array([2, 3, 5, 6, 1, 2,
              3, 4, 8, 1, 2, 1,
              3, 2, 5, 1, 4, 4,
              8, 6, 4, 3, 1, 9,
              6, 2, 1, 2, 5, 5]) #масив(будинок) з 30 квартир, в кожній з яких знаходиться певна кількість жителів
print(q)

k = [] #пустий список
for i in range(len(q)): #проходимося по нашому масиві
    k.append(i) #і добавляємо всі індекси в пустий список
print(np.append(np.delete(q, k), list(q)[::-1])) #за допомогою delete видаляємо всі елементи і за допомогою append
#та повертаємо їх вже в обратному порядку

v = 0 #кількість квартир в яких більше 5 жителів
for i in range(len(np.append(np.delete(q, k), list(q)[::-1]))): #проходимося по нашому новому масиві
    if np.append(np.delete(q, k), list(q)[::-1])[i] > 5: #і якщо в квартирі більше 5 жителів
        v += 1 #то добавляємо +1
print(v)
