#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#57. Відомість на зарплату представлена як дві таблиці. Одна містить
#прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
#працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
#працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
#заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
#зарплата якого мінімальна.
import numpy as np #імпортуємо numpy

q = np.array(['лавренюк', 'бутлерський', 'присяжнюк', 'огороднік', 'гогу',
              'ткаченко', 'тарасов', 'панасієнко', 'килимчук', 'салчук']) #масив(таблиця) з прізвищами працівників цеху
print(q)
d = np.array([12000, 13432, 10000, 8900, 6070, 13320, 8334, 9810, 8990, 11100]) #їхня заробітна плата
print(d)

m = [] #пустий список
l = [] #пустий список
for i in range(len(d)): #проходимося по масиву
    if d[i] == max(d): #якщо елемент масиву дорівнює найбільшому елементу
        m.append(d[i]) #то добавляємо його в пустий список m
        l.append(i) #і добавляємо його індекс в другий пустий список l
        d[i] = 0 #щоб знайти ще одного працівника з найбільшою заробітною платою, замінюємо першу заробітну плату
        #тимчасово на нуль
        break

z = [] #пустий список
x = [] #пустий список
for i in range(len(d)): #проходимося по масиву
    if d[i] == max(d): #якщо елемент масиву дорівнює найбільшому елементу
        z.append(d[i]) #то добавляємо(другу найбільшу з.п.)його в пустий список z
        x.append(i) #і добавляємо його індекс в другий пустий список l
        d[l] = m #повертаємо нашу першу макс. заробітну плату
        break
print(q[l],':',m,';',q[x],':',z) #виводимо прізвища двох працівників з найбільшою з.п.

print(np.delete(q, list(d).index(min(d)))) #за допомогою delete() видаляємо з першого масиву прізвище працівника з найменшою з.п.
print(np.delete(d, list(d).index(min(d)))) #і так само з другого видаляємо його зарплату

#Оцей пункт: "Знайдіть прізвище працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
#працівників за поточний місяць" - я не зробив, тому що не знаю як це реалізувати
