#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#58. Дан одновимірний масив цілих чисел. Знайдіть, скільки разів в ньому повторюється найчастіше число.
import numpy as np #імпортуємо numpy
import random #імпортуємо random
from collections import Counter #імпортуємо collections

q = np.array([random.randint(1, 10) for i in range(20)])
print(q)

s = Counter(list(q)).most_common(1)[0][0] #робимо з нашого масиву список і за допомогою most_common([n])
#знаходимо найчастіший елемент нашого масиву
print(s)

k = 0 #кількість найчастішого елементу у масиві
for i in q: #проходимося по нашому масиві
    if i == s: #якщо наш найчастіший елемент збігається зі значенням елемента масиву, то
        k += 1 #збільшуємо на 1
print('Кількість повторень найчастішого числа у масиві: ', k)
