#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з
#елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
#елементів масиву.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

e = np.array([random.randint(-10, 10) for i in range(8)]) #масив з рандомних цілих чисел
print(e)

j = 0 #кількість від'ємних елементів масиву
for i in range(len(e)): #проходимося по нашому масиві
    if e[i] < 0: #якщо елемент від'ємний, то добавляємо +1
        j += 1
print(j)
