#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#7. Створіть масив А [1..12] за допомогою генератора випадкових чисел з
#елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
#масиву числом 0.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

r = np.array([random.randint(-20, 10) for i in range(12)]) #масив з рандомних цілих чисел
print(r)

for i in range(len(r)): #проходимося по нашому масиві
    if r[i] < 0: #якщо елемент від'ємний, тоді
        r[i] *= 0 #заміняємо його на нуль
print(r)
