#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#8. Створіть цілочисельний масив А [1..15] за допомогою генератора
#випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
#найбільший елемент масиву і його індекс.
import numpy as np #імпортуємо numpy
import random #імпортуємо random

t = np.array([random.randint(-15, 30) for i in range(15)]) #масив з рандомних цілих чисел
print(t)

q=max(t) #максимальний елемент масиву
print(q)

for i in range(len(t)): #проходимося по нашому масиві
    if t[i] == q: #індекс максимального елементу масиву
        print(i)
